
ABOUT_TEXT = """
Филиал <b>ГКУ КК ЦЗН Краснодарского края в Ленинградском муниципальном округе</b>

<b>🕒 График работы:</b>  
Пн - 08:00 – 20:00  
Вт - 08:00 – 20:00  
Ср - 08:00 – 20:00 
Чт - 08:00 – 20:00  
Пт - 08:00 – 16:00
Сб - <b>Выходной</b>  
Вс - <b>Выходной</b>  

<b>📞 Контакты:</b>   
Горячая линия: <code>7-22-40</code>
Сайт: <a href="https://kubzan.ru/EE/Offices/GeneralInfo/430?">Филиал ГКУ КК ЦЗН Краснодарского края</a>  
E-mail: <a href="mailto:leningradskaya@czn.krasnodar.ru">leningradskaya@czn.krasnodar.ru</a>  

<b>🌐 Социальные сети:</b>  
<a href="https://vk.com/czn_leningradskaya23">ВКонтакте</a> |  
<a href="https://ok.ru/group/59256801984551">Одноклассники</a> |  
<a href="https://t.me/lng_czn">Телеграм</a>
"""


APPLICATION_TEXT = """
<b>Порядок подачи заявления:</b> 
1. Зарегистрируйтесь на <a href="https://www.gosuslugi.ru">Госуслугах</a>
2. Перейдите на сайт <a href="https://trudvsem.ru">Работа в России</a> и нажмите на кнопку <b>"Войти"</b> в правом верхнем углу страницы
3. Войдите в <b>личный кабинет соискателя</b> через портал Госуслуг
4. Нажмите кнопку <b>"Создать резюме"</b> и заполните всю необходимую информацию
5. Укажите желаемую должность в названии резюме
6. Добавьте фразу <b>"Нахожусь под риском увольнения"</b>, если вы находитесь в режиме простоя, неполного рабочего дня, в отпуске без сохранения заработной платы или на вашем предприятии планируется сокращение штата (ликвидация организации)
7. Нажмите на кнопку <b>"Сохранить и опубликовать"</b>. Ваше резюме будет отправлено на модерацию (проверку)
8. Для подачи заявления на получение услуги содействия в поиске подходящей работы на портале выберите "Все сервисы" -> "Все услуги" -> "Подать заявление"
9. Если вы не работаете, не зарегистрированы в качестве самозанятого, ИП или участника юридического лица и имеете постоянную регистрацию по месту жительства в Ленинградской, то выберите <b>"Я претендую на признание безработным"</b>
10. Если вы заняты, но хотите сменить работу, найти подработку, являетесь получателем пенсии (в том числе досрочной), учащимся очной формы обучения (студентом) или не имеете постоянной регистрации по месту жительства в Ленинградской, то выберите <b>"Я ищу работу и не претендую на пособие по безработице"</b>
11. Прикрепите свое резюме к заявлению. Без резюме система <b>не примет заявление</b>
12. В поле <b>"Место оказания услуги"</b> выберите <b>Центр занятости населения Ленинградского района</b>
13. Заполните все необходимые поля, отмеченные красной звездочкой
14. Нажмите <b>"Отправить заявление"</b> и ожидайте обратной связи от Центра занятости населения
15. Отслеживайте уведомления, направляемые вам Центром занятости населения в личном кабинете и на электронной почте
"""

EMPLOYERS_PROFESSIONAL_EDUCATION_TEXT = """
Опережающее обучение - хороший шанс повысить уровень квалификации сотрудников, расширить их компетенции, необходимые для выполнения трудовых обязанностей.

Опережающее обучение организуется для <b>следующих категорий граждан</b>:
• работников, находящихся под угрозой увольнения;
• работников организаций, осуществляющих реструктуризацию, модернизацию, реализующих инвестиционные проекты, проекты повышения производительности труда, развития персонала, импортозамещения;
• работников организаций, входящих в кластеры Ленинградской;
• ищущих работу граждан.

Опережающее обучение является бесплатным для работников предприятий (организаций), организуется на основании заявок предприятий (организаций). 

Выбор образовательной организации осуществляется путем проведения процедур закупок в соответствии с Положением о закупках ЦЗН Ленинградского муниципального района. Опережающее обучение осуществляется на основании заключенных договоров на оказание образовательных услуг.

За <b>дополнительной информацией</b> можете обратиться по телефону горячей линии: <code>7-22-40</code>
"""

EMPLOYERS_SEMINARS_TEXT = """
<b>🗓️ Расписание актуальных онлайн и оффлайн семинаров</b>:

<b>Июль</b>
• 5 июля – Встреча с работодателями <i>«Как привлекать молодые кадры»</i>
📍 Администрация района, 14:00–16:00
• 22 июля – <i>Ярмарка стажировок для студентов</i> (организация совместно с КубГАУ)
📍 КубГАУ, корпус 3, 10:00–15:00

<b>Август</b>
• 2 августа – Семинар <i>«Кадровое делопроизводство в 2025 году»</i>
📍 Центр занятости, 09:00–11:00
• 16 августа – Круглый стол <i>«Развитие сельского туризма»</i> (для предпринимателей)
📍 Гостевой дом «Казачий двор», 12:00–15:00
"""

CITIZENS_PROFFESIONAL_EDUCATION_TEXT = """
<b>📌 Кто может пройти обучение?</b>
Бесплатные курсы доступны:
• Безработным, стоящим на учете в ЦЗН
• Гражданам под риском увольнения (если работодатель подаст заявку)
• Матерям в декрете, инвалидам, предпенсионерам
 
<b>📝 Какие нужны документы?</b>
1. Паспорт (оригинал + копия)
2. Трудовая книжка (если есть)
3. СНИЛС
4. Документ об образовании (аттестат/диплом)
5. Справка о статусе безработного (выдает ЦЗН)
    
<i>Для отдельных программ могут запросить дополнительные документы (например, медсправку для поваров)</i>
    
<b>📌 Как подать заявку? Пошаговая инструкция</b>
Шаг 1. <b>Выберите профессию</b>
Посмотрите актуальные курсы на:
• Портале <a href="https://trudvsem.ru">Работа в России</a>
• В группе ВКонтакте: <a href="https://vk.com/czn_leningradskaya23">ЦЗН Ленинградского района</a>

Шаг 2. <b>Подайте заявление</b>
🔹 Через Госуслуги:
1. Зайдите в раздел «Занятость» → «Профобучение»
2. Выберите курс и отправьте заявку
🔹 Лично в ЦЗН:
Приходите в Центр занятости с документами. Специалист поможет оформить заявление

Шаг 3. <b>Дождитесь одобрения</b>
• Срок рассмотрения — до 10 рабочих дней
• Вам придет уведомление (по SMS или в личный кабинет)
    
Шаг 4. Начните обучение
• Курсы проходят очно (в учебных центрах Краснодара и Ленинградской) или онлайн
• Длительность — от 1 до 6 месяцев
• По окончании — госсертификат и помощь в трудоустройстве
"""

IS_NOT_UNEMPLOYED_TEXT = """
<b>Случаи, при которых принимается решение об отказе в признании гражданина безработным</b>:

1. Несоответствие базовым требованиям
• Возраст младше 16 лет
• Получение пенсии (страховая по старости, досрочная, государственная по выслуге лет)

2. Отказ от предложенных вариантов трудоустройства или обучения
• Отказ от двух подходящих вакансий в течение 10 дней после регистрации
• Для впервые ищущих работу без квалификации – отказ от двух предложений обучения или временной работы
• Отказ от трудоустройства после переговоров с работодателями (по двум вариантам)
    
3. Нарушение сроков и процедур взаимодействия с центром занятости
• Неявка для регистрации в качестве безработного без уважительной причины (кроме инвалидов I–II групп)
• Непредоставление в электронной форме (через цифровую платформу):
    - информации о результатах переговоров с работодателями – в течение 3 рабочих дней;
    - подтверждения прохождения переговоров – в течение 2 дней после получения предложений.
• Непредоставление отметки работодателя о причине отказа в трудоустройстве (если работодатель не зарегистрирован на цифровой платформе)
    
4. Предоставление недостоверных данных - указание ложных сведений об отсутствии работы, заработка или иных данных, влияющих на признание безработным
    
5. Ограничения по статусу или занятости
• Осуждение к исправительным, принудительным работам или лишению свободы (если не условно)
• Обучение на очной форме (кроме направлений от центра занятости)
• Уход за инвалидом I группы, ребенком-инвалидом или пожилым старше 80 лет, требующим постоянного ухода
• Приемное родительство (опека над детьми или пожилыми)
• Статус самозанятого (плательщик налога на профессиональный доход)
• Отнесение к категориям, указанным в ст. 3 ФЗ «О занятости» (ИП, военнослужащие и др.)

<b>Примечание:</b> Уважительные причины (болезнь, чрезвычайные обстоятельства) должны быть подтверждены документально.
"""

RE_REGISTRATION_AS_UNEMPLOYED_TEXT = """
Если вы <b>отозвали заявление</b> на портале <a href="https://trudvsem.ru/">«Работа России»</a>:
• Выбрали причину отзыва заявления «не требуется содействия сотрудников ЦЗН». В этом случае можно будет подать заявление повторно только через месяц.
• Если причина в изменении информации о необходимости признать/не признавать вас безработным, то повторно подать заявление можно сразу после снятия с учета.
• Вам отказали в приеме заявления из-за отсутствия резюме. В этом случае можно подать новое заявление сразу же.
    
<b>Отказ в признании безработным</b>: если вам отказали в признании безработным,тто повторно подать заявление можно через месяц после отказа.
    
<b>Причины отказа</b>:
 1. В течение 10 дней вы отказались от 2-х вариантов подходящей работы, а впервые ищущие работу и ранее не работавшие, при этом не имеющие квалификации - в случае двух отказов от профессионального обучения или от предложенной оплачиваемой работы, включая работу временного характера
2. Вы не направили в органы службы занятости информацию о выборе двух вариантов подходящей работы или профессионального обучения через портал <a href="https://trudvsem.ru/">«Работа России»</a>
3. Вы не явились для регистрации в качестве безработного в назначенный день без уважительной причины (за исключением инвалидов I и II групп)
4. Вы предоставили документы, содержащие заведомо ложные сведения
    
Подробнее ознакомиться с причинами отказа можно в ст. 3 п.3 закона <a href="https://www.consultant.ru/document/cons_doc_LAW_60/e8db22bb3d2f8269f06f80a9749a8ff61bcf8bf5/">
«О занятости населения в Российской Федерации»</a>.
"""


RE_REGISTRATION_UNEMPLOYED_CITIZENS_TEXT = """
<b>Перерегистрацию нужно проходить всем, кто стоит на учете в качестве безработного</b>.
От этого зависит, сохранится ли ваше пособие по безработице. 
Перерегистрация проходит <b>не более 2-х раз в месяц</b> и только в <b>очном формате</b>.
Дату следующей перерегистрации вы можете узнать при личном приеме в АЗН, либо в день признания безработным.
Если вы пропустите перерегистрацию, то пособие по безработице приостановится <b>на один месяц</b>. 
<b>При неявке более месяца вас снимут с учета в качестве безработного</b>.
"""

HOW_TO_DERIGISTER_TEXT = """
<b>Для снятия с учета в качетсве безработного </b> отзовите заявление на портале 
<a href="https://trudvsem.ru/">«Работа России»</a>.
    
Нужно войти в личный кабинет через <a href="https://esia.gosuslugi.ru/login/">«Госуслуги»</a>, внизу справа выбрать <b>«Передать сведения»</b>, нажать на кнопку <b>«Добавить сведения»</b> и выбрать вид сведений <b>«Сведения о трудоустройстве, обучении»</b>.
Далее заполните сведения о трудоустройстве и прикрепите скан или фотографию документа, подтверждающего трудоустройство.
"""

HOW_TO_GET_CERTIFICATE_TEXT = """
 <b>Для получения справки из ЦЗН</b> нужно отправить электронное письмо в АЗН вашего района  и указать, какая справка нужна, ваши ФИО и паспортные данные.
    
<b>Виды справок</b>:
• о наличии или отсутствии регистрации в ЦЗН;
• о начислениях, сделанных Центром занятости за определенный период;
• архивная справка о периодах, в которые гражданин был зарегистрирован как безработный и получал пособие.
Справка придет на электронную почту. <b>Проверяйте папку "спам"</b>.
Срок изготовления: <b>от 1 до 5 рабочих дней</b>.
"""

EVENTS_TEXT = """
<b>Информация о предстоящих мероприятиях</b>
    
<b>Июль</b>
• 3 июля – <i>Ярмарка вакансий «Сезонная работа»</i>
📍 Парк им. Островского, 09:00–13:00
 ✅ Вакансии: аниматоры, официанты, подсобные рабочие.
• 17 июля – Семинар <i>«Как открыть ИП»</i> (для желающих начать бизнес)
📍 Центр занятости, 14:00–16:00
• 25 июля – <i>День карьеры в сельском хозяйстве</i>
📍 Агрокомплекс «Кубань», 10:00–15:00
    
<b>Август</b>
• 7 августа – Ярмарка вакансий <i>«Крупные работодатели района»</i>
📍 ДК «Юбилейный», 09:00–14:00
✅ Участвуют: заводы, логистические компании, соцучреждения.
• 14 августа – Тренинг <i>«Собеседование без стресса»</i>
📍 Центр занятости, 11:00–13:00
• 21 августа – Ярмарка вакансий <i>«Работа для молодежи»</i>
📍 Станичная площадь, 10:00–14:00
"""